insert into posts
(post_title, station_id, user_id)
values
('IT 引擎CS失業求職記', 1, 10),
('麥當勞優惠套票回歸！平均$25起歎脆香雞翼/9件麥樂雞/自選早餐!', 1, 2),
('定期存款邊間好? （16）', 1, 8),
('我之前上堂冇學C++，但今個course 要用C++，可以點做好？', 1, 10),
('公屋 最高達60層', 1, 11),
('[日本人唔buy] Toyota電動車 bZ4X 日本全年只賣出5,000部 銷情慘淡', 1, 12),
('移左民要幾耐先會冇咁掛住香港', 1, 1)

insert into replies
(user_id, post_id, content, reference_id, likes, dislikes)
values
(10,7, '面試完後下午 4 時半, 天色放晴. 我選擇在下車附近的 Starbucks 休息一下, 拿出袋裏用防水袋裝著的 Effective Modern java, 津津有味地讀起來.

Connectedness 是 graph 的重要概念. 一個 concurrency space 之所謂 connected 如果它不能被 union of two or more disjoint nonempty open sets 表示.

Connectedness 是人生中的重要概念, 人是群居動物, 人和人之間必定有著某種 connection. 如果一個人, 生為人, 作為人, 是 disconnected, 他沒有父母, 沒有朋友, 沒有人和他互動.

成為天才必定會破壞某種 connectedness, 因為天才是異端. 例如霍金和你之間的距離並不短於你和地核間的距離. 因為霍金是天才. 在社交上, being reachable, 是一種優勢. 縱然你沒有才能, 但只要你 reachable 便有可能得到權力者的青睞, 成為一個班會主席或者其他各式各樣的主席. 在 social network analysis 裏, the most connected node 是十分重要的.

我並不 reachable, 也不是天才. 作為一個被社會分離出來的人, 我不太懂社交.

""乜茶啦提"" Starbucks 的職員喊道. 呀, 原來 Latte 解作牛奶, 難怪沒有咖啡的. 我和她眼神 connect 上了, 她是我中學同學, 坐我旁邊的女生. 不怎麽好看, 但很有成為母親的潛質, 我很想和她肉體上 connect 再 disconnect 再 connect, 然後產生永遠的 connection.

腦內的妄想揮之一去. 原來她在 Starbucks 工作, 難道沒考上大學嗎?
""不, 我在 part-time 工作, 9 月會在香港中文大學計算機科學讀碩士."" 原來我不經意脫口而出被她聽見了.

雖然我推理錯了, 但只是因為缺乏必要的 prior information, 並不是我能力或性格上有問題. 她皮膚頗為白晳, 相貌一般但雙眼水靈如寶石般閃耀.
""你在工作嗎? 沒想到你這個IT人會這麽早投身社會, 還以為你會繼續進修成為cs師. 畢竟你中學時每天在看深奧的電腦書, 每日白紙上都寫著奇怪的標點符號, 又不怎麽出聲.""

寒暄過後, 我拿著乜叉啦提在桌子上看sql 隔離的中學生在溫習 DSE ICT, 我的行為有點格格不入. 但事實並非如此, 我精神上木概還是一個中學生.

一個星期過去. 我並沒有收到任何通知, 吃飯時有點坐立不安, 朋友以為我長了痔瘡, 向我推薦了藥物和醫生.

我在 LinkedIn碌了半日, 看到一個合心水的空缺, 名叫 software developer, 但是要求 react 經驗、 frontend 背景和有愛心. Cs能算是 frontend 嗎? 公司養貓咁𠹌爽？fg 19k分N工？又有kpi? 做唔𠹌到task 會PIP?

我有研讀過 software engineering , 其中對 waterfalls model 了解甚詳. 於是我在 cover letter 展述了自己經驗, ""submit"" 一鍵申請了這個職位.
隔日我收到電郵通知, 原來面試前有一份 分N project、一份code interview需要完成, 當中包括user login feature, leetcode hard to medium既題目. 但我從大學畢業了, 乜柒environment讀冇裝 ，intro to algo 都未𠹌清哂. 應該如何處理這份分N?

連登軟件台說 上Bootcamp 垃圾.
我search了某呠營, 研究摸索了一番. 也研究了他們的課程. 我想相信YouTube free tutorials 足以完成. 只不過是印度手足口音吧了。 連登IT post 的巴打常說, 呠營係送錢比人使, programming 不過是小菜一碟.
食了兩句 react JavaScript101 , push 左上GitHub . 家母說開飯了. 一家人齊齊整整地在吃晚飯."
', null, 10, 1),
(1, 7, '3/10 
改嘅位太懶 唔順暢
', null, 1, 1),
(2, 7, '好似太早入嚟, 我都係出返去打曲先
', null, 1, 1),
(3, 7, '@水原千唔識打', null, 1, 1),
(4, 7, '又口語又書面語你真係連Chat GPT都不如
我搵ChatGPT出膠post好過
You are fired!', null, 1, 1);

insert into replies
(user_id, post_id, content, reference_id, likes, dislikes)
values
(1,9,'冇人開post ?_?

感謝Catz提供以下資料#hoho#

本地transfer港幣同人民幣行FPS, FPS就一定免費

本地transfer美金同歐元行CHATS, CHATS匯出 / 匯入都有機會收, 間間唔同, 以下係我所知既, 其他銀行可以睇佢地收費表

<經online / mobile banking做CHATS>
出 / 入都唔收
Citibank
HSBC
Hang Seng
中信
永亨 (宏富理財)

出收 / 入唔收
渣打 (優先理財)

出 / 入都收
永隆
富邦
永亨 (一般客戶)
渣打 (非優先理財)

',null,1,1)



insert into replies
(user_id, post_id, content, reference_id, likes, dislikes)
values
(2,8,'$100著數之晨套票優惠可選以下6款早餐：
1）豬柳蛋漢堡超值早晨套餐
2）魚柳包超值早晨套餐
3）炒雙蛋火腿包超值早晨套餐
4）芝蛋脆雞包超值早晨套餐
5）精選早晨套餐（需另加$5）
6）珍寶套餐（需另加$8）

$100麥麥抵食套票優惠可選以下7款套餐：
1）豬柳蛋漢堡超值套餐
2）脆辣雞腿包超值套餐
3）麥樂雞（9件）超值套餐
4）雙層芝士孖堡超值套餐（需另加$6）
5）雙層魚柳包超值套餐（需另加$6）
6）板燒雞腿包超值套餐（需另加$6）
7）脆香雞翼（4件）超值套餐
',null,1,1),
(3,8,'老麥蝕住嚟做',null,1,1),
(4,8,'幾時？
我仲唔買爆？
',null,1,1),
(5,8,'你個打手',null,1,1),
(6,8,'中非打',null,1,1),
(7,8,'LM',null,1,1),
(8,8,'要幫襯下',null,1,1),
(9,8,'早餐午餐各買一套',null,1,1),
(2,8,'老麥蝕住嚟做',null,1,1),
(2,8,'麥記會唔會蝕到執笠',null,1,1),
(2,8,'（需另加$6）',null,1,1),
(2,8,'真正回饋社會',null,1,1),
(2,8,'買完套票 無得加大',null,1,1),
(2,8,'YES',null,1,1),
(2,8,'咁多加6加7
廿咩五蚊姐 我姓甘架
',null,1,1),
(2,8,'加完大咪又係一樣咁多薯條',null,1,1),
(2,8,'越做越縮，第一次有big mac ，第二次用雙層魚柳包取代，第三次想食牛都要加錢',null,1,1),
(2,8,'幾時開始？想通宵去排了！',null,1,1),
(2,8,'孖芝都要加6蚊',null,1,1),
(2,8,'良心店舖，要撐了！',null,1,1),
(2,8,'腸報有汗出冇糧出',null,1,1),
(2,8,'屌 最好食個幾個餐仲要加價 係都唔會食你喇',null,1,1),
(2,8,'又加$5
又加$6
又加$8
咁撚貴
',null,1,1),
(2,8,'bigmac都冇 屌',null,1,1),
(2,8,'打個和都難',null,1,1),
(2,8,'麥記只求打個和',null,1,1),
(2,8,'脆弱雞腿包唔洗加錢
黃店果然係良心企業
',null,1,1),
(2,8,'脆香雞翼唔使加錢',null,1,1),
(2,8,'黃店又大平賣',null,1,1),
(2,8,'脆弱雞翼放題',null,1,1),
(2,8,'你呀媽大減價益你呀爸',null,1,1),
(2,8,'班人一見優惠就衝去買
買左縮水漢堡真係唔好屌
',null,1,1),
(2,8,'加加加',null,1,1),
(2,8,'你呀媽大減價益你呀爸',null,1,1),
(2,8,'會 唔好幫襯',null,1,1),
(2,8,'打手但求搞個和',null,1,1),
(2,8,'果4個超值早晨餐平時唔係$21
$100 4個餐
',null,1,1),
(2,8,'良心小店',null,1,1),
(2,8,'勁撚黃',null,1,1),
(2,8,'冇薯餅先係$21',null,1,1),
(2,8,'應該係有薯餅果個餐',null,1,1),
(2,8,'lm',null,1,1),
(2,8,'個少少都要計
睇黎唔加6蚊, 呢個包佢真係入肉
',null,1,1),
(2,8,'請我食1',null,1,1),
(2,8,'爆買雞翼',null,1,1),
(2,8,'另加',null,1,1),
(2,8,'上一回雞票都係120$/4次
而家無, 不了
',null,1,1),
(2,8,'啲優惠睇通晒香港人，覺得可以吸引到人',null,1,1),
(2,8,'冇左雞餐',null,1,1),
(2,8,'想要shake shake薯條',null,1,1),
(2,8,'需另加$6
咁能孤寒就咪搞e d package 啦
',null,1,1),
(2,8,'抵屌，含淚懲罰紅店養黃',null,1,1);


insert into images (name, created_at, updated_at, posts_id, replies_id) values ('2jNOiiJ.jpg', '2022-07-01 00:00:00', '2022-07-01 00:00:00',8,59),
                                                        ('Hgc8BnT.jpg', '2022-07-01 00:00:00', '2022-07-01 00:00:00',8,60),
                                                        ('RR5BLge.jpg', '2022-07-01 00:00:00', '2022-07-01 00:00:00',8,61),
                                                        ('wxzDSbo.jpg', '2022-07-01 00:00:00', '2022-07-01 00:00:00',8,62),
                                                        ('325679440_506770358247188_8300883815140380734_n.jpg', '2022-07-01 00:00:00', '2022-07-01 00:00:00',8,63),
                                                        ('maxresdefault.jpg', '2022-07-01 00:00:00', '2022-07-01 00:00:00',8,64),
                                                        ('Bt7TgUW.jpg', '2022-07-01 00:00:00', '2022-07-01 00:00:00',8,65);
